### LOAD IMPORTS

In [2]:
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
from urllib.parse import quote_plus
from sqlalchemy.types import *
## importing text function to use on query with a "%" in it
from sqlalchemy import text
import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
username = "root"
password = quote_plus("Brian@Schreffler")
db_name = "movies"

In [4]:
connection_str = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection_str)

In [5]:
database_exists(connection_str)

True

In [6]:
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

### LOAD IN DATA

In [7]:
df_basics = pd.read_csv('Data/title_basics1.csv.gz')
df_basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"

In [8]:
df_ratings = pd.read_csv('Data/title_ratings1.csv.gz')
df_ratings.head(1)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965

### Getting List of Unique Genres

In [9]:
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [10]:
tmbd_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmbd_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.0,3.0,NaN

In [11]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
146546,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
146547,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
146548,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
146548,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
146549,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [12]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

### Create a new title_genres table

In [13]:
## Save just tconst and genres split as new df
title_genres = exploded_genres [['tconst','genres_split']].copy ()
title_genres.head ( )

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### Create a genre mapper dictionary to replace string genres with integers

In [15]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### Replace the string genres in title_genres with the new integer ids.

In [16]:
genre_lookup = pd.DataFrame({ 'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Convert the genre map dictionary into a dataframe.

In [17]:
df_basics = df_basics.drop(columns=['originalTitle', 'genres', 'isAdult', 'titleType', 'genres_split'])

In [18]:
df_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0079644,November 1828,2001,NaN,140
4,tt0088751,The Naked Monster,2005,NaN,100

In [19]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146550 entries, 0 to 146549
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          146550 non-null  object
 1   primaryTitle    146550 non-null  object
 2   startYear       146550 non-null  int64
 3   endYear         0 non-null       float64
 4   runtimeMinutes  146550 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 5.6+ MB

In [20]:
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()

df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [21]:
df_basics.to_sql('title_basics',engine, dtype=df_schema, index = False, if_exists ='replace')

146550

In [22]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [23]:
df_ratings.to_sql('title_ratings',engine, dtype=df_schema, index = False, if_exists ='replace')

972187

In [24]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [25]:
title_genres.to_sql('title_genre',engine, dtype=df_schema, index = False, if_exists ='replace')

254653

In [26]:
genre_lookup.to_sql('genres',engine, dtype=df_schema, index = False, if_exists ='replace')

26

In [27]:
tmbd_df.to_sql('tmdb_data',engine, dtype=df_schema, index = False, if_exists ='replace')

4505